{
  "elements": [
    {
      "id": "funds",
      "description": "Funds for running the tavern. Shared between the Taverner and the Scribe.",
      "aspects": {
        "denier": 1
      }
    },
    {
      "id": "scribe.sestertius",
      "label": "Sestertius",
      "description": "A Roman bronze coin. The Scribe flips it quite a lot. It might be a prized artifact, or something more?"
    },
    {
      "id": "shoppinglist.tavern.ch2",
      "label": "Shopping List For The Week. Cost: 1 funds.",
      "description": "Onion for fermenting herrings, peas, and beer hops green as spring. The taverner must have left the shopping list here intentionally. Time to head to the market."
    },
    {
      "id": "shoppinglist.tavern.ch3",
      "label": "Shopping List For The Week. Cost: 2 funds (if not spent at market, it will be deducted at end of chapter).",
      "description": "The shopping list contains peas, carrots, cheese, oat, eggs, and on the last line, a crookedly written 'wine'. It has been crossed off by someone else. "

    },
    {
      "id": "bishop.brooch",
      "label": "Brooch",
      "description": "It is large and circular, half hollowed, half intricately carved with vine-like patterns. A cross lands slanted across the disc. At the center of the cross was a lazuli, lustrous in hue, blue as the sea. The cross bore intricate engravings too, as if restrained by an invisible force."
    },
    {
      "id": "poison.hemlock",
      "label": "Hemlock",
      "description": "Hemlock is a highly poisonous plant that has been used as a poison in various works of literature. It can cause paralysis and respiratory failure.",
      "aspects": {
        "plant": 1,
        "poison": 1
      }
    },
    {
      "id": "poison.cyanide",
      "label": "Cyanide",
      "description": "Cyanide is a fast-acting poison that affects the body's ability to use oxygen. It can cause rapid loss of consciousness and cardiac arrest.",
      "aspects": {
        "poison": 1
      }
    },
    {
      "id": "poison.nightshade",
      "label": "Nightshade",
      "description": "Nightshade plants, such as Belladonna or Deadly Nightshade, contain toxic compounds that can cause hallucinations, respiratory distress, and even death.",
      "aspects": {
        "plant": 1,
        "poison": 1
      }
    },
    {
      "id": "poison.strychnine",
      "label": "Strychnine",
      "description": "Strychnine is a highly toxic alkaloid that affects the nervous system, leading to muscle spasms, convulsions, and respiratory failure.",
      "aspects": {
        "poison": 1
      }
    },
    {
      "id": "poison.digitalis",
      "label": "Digitalis",
      "description": "Digitalis, derived from the foxglove plant, contains cardiac glycosides. It has been historically used to treat heart conditions, but in high doses, it can be toxic. Overdosing on digitalis can cause irregular heart rhythms, nausea, vomiting, and visual disturbances.",
      "aspects": {
        "plant": 1,
        "poison": 1
      }
    },
    {
      "id": "poison.mercury",
      "label": "Mercury",
      "description": "Mercury is a toxic metal that has been used in various forms throughout history. Ingesting or inhaling mercury vapors can lead to mercury poisoning, causing symptoms like neurological impairment, kidney damage, respiratory issues, and gastrointestinal problems.",
      "aspects": {
        "poison": 1
      }
    },
    {
      "id": "poison.wolfsbane",
      "label": "Wolfsbane",
      "description": "Its roots and leaves contain aconitine alkaloids, which can affect the heart and nervous system. Ingesting aconite can lead to symptoms like numbness, tingling, paralysis, cardiac arrhythmias, and respiratory failure.",
      "aspects": {
        "plant": 1,
        "poison": 1
      }
    },
    {
      "id": "medicine.comfrey",
      "label": "Comfrey",
      "description": "Its roots and leaves contain allantoin and rosmarinic acid. They make skins and bones grow faster, and relieve pain and inflammation.",
      "aspects": {
        "plant": 1,
        "medicine": 1
      }
    },
    {
      "id": "medicine.coriander",
      "label": "Coriander",
      "description": "Its leaves taste distinctly different from the roots. Besides pickling vegetables and making sausages, coriander also makes the fever goes down.",
      "aspects": {
        "plant": 1,
        "medicine": 1
      }
    },
    {
      "id": "cat",
      "label": "Juniper",
      "description": "The cat is said to be from a juniper forest in the mountains. She has a pair of grey eyes that are strikingly similar to the Scribe’s, or maybe it is the other way around.",
      "slots": [
        {
          "id": "slot.cat.person",
          "label": "Character",
          "actionid": "tavern.public.cat",
          "required": {
            "taverner": 1,
            "scribe": 1
          },
          "description": "Who is the lucky one to pet Juniper this time?"
        }
      ]
    }
  ]
}