{
  "elements": [
    {
      "id": "memory.ch1.dining1a",
      "label": "Memory: Feast after victory",
      "description": "They enjoyed grilled lamb and mulled wine. The Soldier receives the most toasts. Their cheeks getting redder each time.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.ch1.dining1b",
      "label": "Memory: Feast with friends",
      "description": "They enjoyed mushroom pasties and fried fish. Afterwards, most of them stayed to play cards. The grey-eyed Scribe won the most.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.ch2.dining1a",
      "label": "Memory: First arrival in the fort",
      "description": "The Knight remembers their first arrival at the fort a year ago. They were treated very well by the Baron and the Scribe.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.ch2.dining1b",
      "label": "Memory: Discussing tactics with friends",
      "description": "The Knight remembers that they had good friends in Shroudburn, who are now enemies.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.brooch2",
      "label": "Memory: The brooch's acquirement",
      "description": "The Knight looted the brooch after a battle. They intend to keep the brooch for themselves.",
      "unique": true,
      "aspects": {
        "mainmemory": 1
      }
    },
    {
      "id": "memory.brooch3",
      "label": "Memory: The brooch's new owner",
      "description": "The brooch did not stay with the Knight for too long. The Knight gave it away for someone more fitting.",
      "unique": true,
      "aspects": {
        "mainmemory": 1
      }
    },
    {
      "id": "memory.ch4.dining1a",
      "label": "Memory: Dining with the Baron",
      "description": "The Knight misses the time they spent at the fort with the Baron and the Scribe, who were lively and interesting company.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.ch4.dining1b",
      "label": "Memory: Dining with the Scribe",
      "description": "The Knight loved telling stories during meals and the Scribe was a great listener.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.ch5.dining1a",
      "label": "Memory: Playing cards with the Baron and the Scribe",
      "description": "The Knight remembered playing cards with the Baron and the Scribe at the fort. The Scribe was an amazing card player and teacher.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.ch5.dining1b",
      "label": "Memory: Philosophical discussion with the Scribe",
      "description": "The Scribe is the most peculiar person the Knight has ever met. They are very philosophical, yet they do not believe in God.",
      "aspects": {
        "mainmemory": 1
      }

    },
    {
      "id": "memory.cointoss.2",
      "label": "Memory: Why flipping coins?",
      "description": "|Memory: The First Coin Flip card description|",
      "aspects": {
        "mainmemory": 1
      }
    },
    {
      "id": "memory.formerstudent",
      "label": "Memory: Scribe's former student",
      "description": "|Memory: Former student card description|",
      "aspects": {
        "mainmemory": 1
      }
    },
    {
      "id": "memory.spookedhorse",
      "label": "Memory: How to save someone from a spooked horse",
      "description": "|Memory: How to save someone from a spooked horse card description|",
      "aspects": {
        "mainmemory": 1
      }
    },
    {
      "id": "memory.deadhorse",
      "label": "Memory: Strange wound on the Bishop's dead horse",
      "description": "|Memory: Strange wound on the Bishop's dead horse card description|",
      "aspects": {
        "mainmemory": 1
      }
    },
    {
      "id": "memory.gp",
      "label": "Memory: A gift and a promise",
      "description": "In the cave they seeked shelter in, the Bishop helped the Knight to sit down. Then the Bishop wanted to find some branches to light a fire, and maybe fix the Knight's arm. Fear and a silent plea flickered in the Knight’s eyes, but they quickly concealed them. With numb fingers, the Knight fumbled to untie their cloak for the Bishop. The Bishop stopped the Knight. <i>\"Don't worry. I won't leave you here.\"</i> The Bishop’s voice was firm, comforting. After looking at the Knight once more, the Bishop disappeared into the snow. It was the longest wait in the Knight's life. But when the Knight saw the Bishop returned with sticks, snow on their hair and cloak, they chuckled. <i>\"You really come back. I've never been happier in this life.\"</i> The Bishop started a fire, and the Knight leaned against the Bishop, feeling warm and secure. They murmured: <i>\"You know where I live. When we get back, come find me in my room. I have a gift for you.\"</i> <i>\"Alright.\"</i> replied the Bishop, smiling.",
      "aspects": {
        "mainmemory": 1
      }
    }
  ]
}