{
  "recipes": [
    {
      "id": "recipe.ch4.tavernerscribe",
      "actionid": "converse",
      "label": "Conversation: Taverner & Scribe",
      "craftable": "true",
      "startdescription": "The smell of fried fish pulls the Scribe away from their own thoughts. They eagerly walk to the table for lunch. The Taverner notices the big smile on the Scribe’s face and asks what it is about.",
      "description": "\"It reminds me of the days when I was the tutor of the Baron. You would bring me fried fish all the way to the fort. They are the most delicious fried fish I’ve ever had.\" says the Scribe. The Taverner looks particularly happy as they fetches over some wine, humming.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "scribe": 1
      },
      "tablereqs": { "chapter4": 1 },
      "effects": { "memory.formerstudent": 1 }
    },
    {
      "id": "recipe.ch4.tavernerarbitrator",
      "actionid": "converse",
      "label": "Conversation: Taverner & Arbitrator",
      "craftable": "true",
      "startdescription": "The Taverner is excited for the approaching Easter, especially for the wine and feasting. They complain about the forty-day fasting, although they have gotten used to only eating fish.",
      "description": "The Arbitrator wonders if the Scribe would go to the Church with them this year. The Taverner says no, unless there are good card games or performances. They then keep ranting on the horrible circus show from last year...",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.tavernerminstrel",
      "actionid": "converse",
      "label": "Conversation: Taverner & Minstrel",
      "craftable": "true",
      "startdescription": "The Taverner calls the Minstrel over and inquires whether they have been stealing bread from the kitchen to feed Juniper. The Minstrel shakes their head in firm denial, but their dodging eyes betray them.",
      "description": "The Taverner raises their eyebrows and asks why there are more rats in the kitchen recently. Shocked, the Minstrel asks how it is related to them in any way. Maybe Juniper just had a change of taste. The Taverner shakes their head, having a hard time to remain serious. They take a few coins out of the Minstrel’s salary and let them go.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "minstrel": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.tavernercook1",
      "actionid": "converse",
      "label": "Interview: Taverner & Cook 1",
      "craftable": "true",
      "startdescription": "The Taverner asks about the cook's specialties, and the cook immediately launches into a passionate monologue. They gush about all the exotic dishes they love to cook and the different ways they know of preserving wine.",
      "description": "The Taverner’s eyes light up as the cook talks about adding sawdust and sand into wine for preservation and flavor. They are clearly intrigued.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "cook1c": 1,
        "temperament": 1,
        "taverners": 1
      },
      "aspects": {
        "exhausted": 1
      },
      "tablereqs": { "chapter": 4 }
    },
    {
      "id": "recipe.ch4.tavernercook2",
      "actionid": "converse",
      "label": "Interview: Taverner & Cook 2",
      "craftable": "true",
      "startdescription": "The Taverner asks the cook about their previous experiences. The cook replies that they served the Baron in Hazelford for a few years. Reminded of all the tales they heard from the Scribe, the Taverner asks why they have left the Baron.",
      "description": "\"Oh, because the Baron held banquets too frequently, and they refuse to give me a raise when I asked for one.\" answers the cook. The Taverner ponders for a while and then nods.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "cook2c": 1,
        "temperament": 1,
        "taverners": 1
      },
      "aspects": {
        "exhausted": 1
      },
      "tablereqs": { "chapter": 4 }
    },
    {
      "id": "recipe.ch4.tavernercook3",
      "actionid": "converse",
      "label": "Interview: Taverner & Cook 3",
      "craftable": "true",
      "startdescription": "The Taverner asks about the cook's specialties and the cook replies tersely. The cook then takes out a loaf of bread from their bag and offers them to try it. They made it themselves.",
      "description": "The Taverner gives it a try and is delighted. They were reminded of the previous cook. Hopefully this young one can last longer here.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "cook3c": 1,
        "temperament": 1,
        "taverners": 1
      },
      "aspects": {
        "exhausted": 1
      },
      "tablereqs": { "chapter": 4 }
    },
    {
      "id": "recipe.ch4.scribearbitrator",
      "actionid": "converse",
      "label": "Conversation: Scribe & Arbitrator",
      "craftable": "true",
      "startdescription": "The Arbitrator mentions that the Prior appears less often for the public recently, expressing slight concern and discontent towards the Prior's negligence. In as casual a manner as possible, the Scribe asks if the Arbitrator knows what the Prior might be occupied with.",
      "description": "\"Word has it that the Doctor has returned from a foreign land, and the Prior has been keenly attentive to their demands for alchemy, just as before.\" the Arbitrator shakes their head disapprovingly.\n\"Is that so?\" replies the Scribe, deep in their own thoughts.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "scribe": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.scribeminstrel",
      "actionid": "converse",
      "label": "Conversation: Scribe & Minstrel",
      "craftable": "true",
      "startdescription": "The Scribe asks the Minstrel if they miss home, since they have been so far away from home for a long time. For a flint of a second, the Minstrel's hand pauses in the air, but then they go on playing with Juniper, never looking up.",
      "description": "\"No.\" answers the Minstrel as nonchalantly as possible. The Scribe looks at them for a while and says that they may get a new cook who can cook their hometown's food. The Minstrel's eyes light up.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "scribe": 1,
        "minstrel": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.doctorlord",
      "actionid": "converse",
      "label": "Conversation: Doctor & Lord",
      "craftable": "true",
      "startdescription": "The Lord finds the Doctor and inquires more about the Bishop's injury and treatment. The Doctor, though unwilling to speak with them, tells them the treatment that they performed on the Bishop before the Lord arrived.",
      "description": "Half out of fear, half out of obligation as a doctor, they also tell the Lord about the medicines they plan to use and some of the predictions they made from observing the stars. The Lord listens with crossed arms and squinted eyes, obviously doubtful of the Doctor’s judgement, but for once does not argue.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "doctor": 1,
        "lord": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.doctorprior",
      "actionid": "converse",
      "label": "Conversation: Doctor & Prior",
      "craftable": "true",
      "startdescription": "The Doctor asks the Prior how they have been for the past few years, and if they like Shimmershore more than Amberbell. The Prior says although Shimmershore was shabby and underdeveloped when they first arrived, they have grown more fond of here now. At least the weather is much warmer.",
      "description": "The Doctor becomes quiet for a moment and ponders. \"But I think you deserve to be somewhere better, to be of higher position. You have the talent and abilities to do more than this.\" says the Doctor. \n\"People here need me.\" replies the Prior, \"People in Amberbell actually don’t care. They flourish well by themselves. Here, they really need me.\"",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "doctor": 1,
        "prior": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.knightsoldier",
      "actionid": "converse",
      "label": "Conversation: Knight & Soldier",
      "craftable": "true",
      "startdescription": "The Knight asks if the Soldier has gotten used to their current life and training. The Soldier nods and assures the Knight that there is no need to worry. The Knight then asks if they enjoyed their life as a cook, and which lifestyle they prefer.",
      "description": "The Soldier scratches their head and smiles awkwardly. They say that they enjoyed being a cook. It is happier and freer comparing to being a soldier, but they are happy to be at the Knight's side.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "knight": 1,
        "soldier": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.vicarprior",
      "actionid": "converse",
      "label": "Conversation: Vicar & Prior",
      "craftable": "true",
      "startdescription": "The Prior calls the Vicar over to talk about pier maintenance. One of the piers for big boats partially collapsed. Thankfully they should have enough budget to repair it. The Vicar agrees and immediately starts to estimate the cost and the hands they would need.",
      "description": "The Vicar also mentions that the bandits in the forest are seriously affecting the town's business. The Prior sighs, saying that the forest is not ruled by them. They can try to send a messages to the neighboring areas and see if they will be kind enough to take on the matter.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "prior": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch4.vicardoctor",
      "actionid": "converse",
      "label": "Conversation: Vicar & Doctor",
      "craftable": "true",
      "startdescription": "The Vicar bumps into the Doctor in the hallway. They express their surprise in the Doctor's sudden return. The Doctor eyes them cold but calmly. The Vicar then asks how long they plan to stay this time.",
      "description": "\"Don’t know. Perhaps months, maybe years, or even...\" the Doctor pauses and grins, \"forever.\" The Vicar stares at them and raises their eyebrow. \"Well, forever is a longtime and things can change very rapidly, remember?\" then Vicar chuckles and leaves.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "doctor": 1
      },
      "tablereqs": { "chapter4": 1 }
    },
    {
      "id": "recipe.ch5.tavernerscribe.first",
      "actionid": "converse",
      "label": "Conversation: Taverner & Scribe",
      "craftable": "true",
      "startdescription": "The Scribe tells the Taverner that they are trying to find a different way to prove the Pythagorean theorem. After trying their best to understand what the Scribe is talking about, the Taverner asks why they cannot just measure every triangle and see if the theorem holds true.",
      "description": "The Scribe chuckles and scratches their chin: \"Nice thought. The Baron suggested the same thing when I tried to teach them how to prove a theorem. It really speaks much to the level of their mathematical intuition.\"",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "scribe": 1
      },
      "tablereqs": {
        "chapter5": 1,
        "memory.formerstudent": 1
      }
    },
    {
      "id": "recipe.ch5.tavernerscribe",
      "actionid": "converse",
      "label": "Conversation: Taverner & Scribe",
      "craftable": "true",
      "startdescription": "The smell of fried fish pulls the Scribe away from their own thoughts. They eagerly walk to the table for lunch. The Taverner notices the big smile on the Scribe’s face and asks what it is about.",
      "description": "\"It reminds me of the days when I was the tutor of the Baron. You would bring me fried fish all the way to the fort. They are the most delicious fried fish I’ve ever had.\" says the Scribe. The Taverner looks particularly happy as they fetches over some wine, humming.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "scribe": 1
      },
      "tablereqs": {
        "chapter5": 1,
        "memory.formerstudent": -1
      },
      "effects": { "memory.formerstudent": 1 }
    },
    {
      "id": "recipe.ch5.tavernerarbitrator",
      "actionid": "converse",
      "label": "Conversation: Taverner & Arbitrator",
      "craftable": "true",
      "startdescription": "The weather is great today. The Taverner feels an urge to go sailing in the afternoon. Out of a whim, they invite the Arbitrator to come along with them.",
      "description": "The Arbitrator instantly refuses. They smile awkwardly and explain that they are afraid of the sea, because they nearly drowned when they were a child.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.tavernerminstrel",
      "actionid": "converse",
      "label": "Conversation: Taverner & Minstrel",
      "craftable": "true",
      "startdescription": "The Minstrel recently wrote a cheerful ballad, full of exotic sceneries, strange people, and extraordinary events. The Taverner has repeatedly expressed their love for this song and asks how they come up with those things in their lyrics.",
      "description": "The Minstrel said they have witnessed some themselves, others are stories they heard during their time in the circus. The Taverner is surprised that the stories sing are real, and expresses their desire to sail around the world one day.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "minstrel": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.scribearbitrator",
      "actionid": "converse",
      "label": "Conversation: Scribe & Arbitrator",
      "craftable": "true",
      "startdescription": "The Arbitrator mentions that recently the Vicar almost does as much sermons as the Prior. They observe that the Vicar is kind and passionate. Their liturgy is somewhat different from that of the Prior, which the Scribe might be interested.",
      "description": "Although the Scribe is skeptical to that claim, they politely ask what the Vicar preaches. The Arbitrator says that the Vicar believes that every individual could connect and communicate with the God, and we should welcome different ideas. Surprised, the Scribe does find it novel and interesting.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "scribe": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.scribeminstrel",
      "actionid": "converse",
      "label": "Conversation: Scribe & Minstrel",
      "craftable": "true",
      "startdescription": "The Scribe wonders whether the Minstrel prefers their current life in the Tavern or their life in the circus before joining them. Tuning the strings on the lute, the Minstrel thinks about it and says that they like their current status.",
      "description": "When asked to elaborate, the Minstrel says it was fun traveling around with the circus and the people were nice. \"Not to say you and the Taverner are not.\" adds the Minstrel quickly. But they sometimes starved and slept in the wilderness in the circus. Here, they don't have to worry about those things.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "scribe": 1,
        "minstrel": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.doctorlord",
      "actionid": "converse",
      "label": "Conversation: Doctor & Lord",
      "craftable": "true",
      "startdescription": "The Doctor asks the Lord whether they've heard about burnet being able to stop bleeding and heal injuries. The Lord raises their eyebrows and claims that they know well that burnet could cure some plague, but have never heard of its healing properties.",
      "description": "The Doctor hesitates for a moment and says they read in a book that burnet, in particular its roots, has healing power and they want to give it a try. The Lord is skeptical and cautions them to be very careful if they plan to use it.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "doctor": 1,
        "lord": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.doctorprior",
      "actionid": "converse",
      "label": "Conversation: Doctor & Prior",
      "craftable": "true",
      "startdescription": "The Prior visits the Doctor in the tower and asks if the Doctor finds everything comfortable. The Doctor shrugs and then nods, saying they are not particular about a place to sleep.",
      "description": "Yet the Doctor says they do need to buy a few things for alchemy. They wonder if the Prior will have time to go with them to the Market. The Prior frowns upon the idea of going to the market but agrees.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "doctor": 1,
        "prior": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.knightsoldier",
      "actionid": "converse",
      "label": "Conversation: Knight & Soldier",
      "craftable": "true",
      "startdescription": "The Knight asks the Soldier what they would do after this. The Soldier shrugs and says they might just go back to being a cook. Worst case scenario, they could always go home.",
      "description": "The Knight then asks if they miss home. \"Sometimes.\" says the Soldier, \"Food at home is always better, but I have friends here.\" The Knight smiles gratefully upon hearing this, their eyes shiny as starlight.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "knight": 1,
        "soldier": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.vicarprior",
      "actionid": "converse",
      "label": "Conversation: Vicar & Prior",
      "craftable": "true",
      "startdescription": "The Vicar approaches the Prior and expresses their concern about raising taxes. The Vicar says they've heard of complaints from the villagers. They knew last year's harvest was not good.",
      "description": "The Prior argues that the church is expanding its school and rants about all the money that the king demanded last year for war. Eventually, the Prior sighs and says they would try to relieve the taxes later this year. The Vicar puts a hand on the Prior’s shoulder and thanks them heartily.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "prior": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.vicardoctor",
      "actionid": "converse",
      "label": "Conversation: Vicar & Doctor",
      "craftable": "true",
      "startdescription": "The Vicar finds the Doctor and asks them to help treat a patient with high fever and have been sweating for days. The Vicar says they've tried everything, but the patient has not shown a hint of recovery.",
      "description": "The Doctor raises their eyebrows, as if to ask why the Vicar would trust their judgement and medication. Then they asked for more details about symptoms. After pondering for a moment, the Doctor writes down some herbs and tells the Vicar to give them a try.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "doctor": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.vicartaverner",
      "actionid": "converse",
      "label": "Conversation: Vicar & Taverner",
      "craftable": "true",
      "startdescription": "The Vicar encounters the Taverner in the market. The Vicar greets the Taverner and asks if their business is going well.",
      "description": "The Taverner replies cheerfully that they are doing well. They also hint the Vicar that they would love to supply wine for their next big gathering. The Vicar merely smiles.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "taverner": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.vicarscribe",
      "actionid": "converse",
      "label": "Conversation: Vicar & Scribe",
      "craftable": "true",
      "startdescription": "The Vicar encounters the Scribe on the streets. The Vicar greets the Scribe politely and expresses their wish of seeing the Scribe in church more frequently.",
      "description": "The Scribe greets them back politely but only smiles very faintly at the Vicar's words. The Scribe says that they might stop by on Easter and leaves.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "scribe": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch5.vicararbitrator",
      "actionid": "converse",
      "label": "Conversation: Vicar & Arbitrator",
      "craftable": "true",
      "startdescription": "The Vicar approaches the Arbitrator after a mass and asks how their tenants are faring. The Arbitrator appreciates the Vicar's caring and concerns. They reply that their tenants are all well, hoping for a harvesting year.",
      "description": "The Arbitrator then expresses their concern about raising taxes. Many tenants are struggling to recover from last year's draught. The Vicar reassures the Arbitrator that they would do their best to relieve the taxes later this year.",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter5": 1 }
    },
    {
      "id": "recipe.ch6.tavernerscribe",
      "actionid": "converse",
      "label": "Conversation: Taverner & Scribe",
      "craftable": "true",
      "startdescription": "|recipe.ch6.tavernerscribe startdescription|",
      "description": "|recipe.ch6.tavernerscribe description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "scribe": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.tavernerarbitrator",
      "actionid": "converse",
      "label": "Conversation: Taverner & Arbitrator",
      "craftable": "true",
      "startdescription": "|recipe.ch6.tavernerarbitrator startdescription|",
      "description": "|recipe.ch6.tavernerarbitrator description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.tavernerminstrel",
      "actionid": "converse",
      "label": "Conversation: Taverner & Minstrel",
      "craftable": "true",
      "startdescription": "|recipe.ch6.tavernerminstrel startdescription|",
      "description": "|recipe.ch6.tavernerminstrel description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "taverner": 1,
        "minstrel": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.scribearbitrator",
      "actionid": "converse",
      "label": "Conversation: Scribe & Arbitrator",
      "craftable": "true",
      "startdescription": "|recipe.ch6.scribearbitrator startdescription|",
      "description": "|recipe.ch6.scribearbitrator description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "scribe": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.scribeminstrel",
      "actionid": "converse",
      "label": "Conversation: Scribe & Minstrel",
      "craftable": "true",
      "startdescription": "|recipe.ch6.scribeminstrel startdescription|",
      "description": "|recipe.ch6.scribeminstrel description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "scribe": 1,
        "minstrel": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.doctorlord",
      "actionid": "converse",
      "label": "Conversation: Doctor & Lord",
      "craftable": "true",
      "startdescription": "|recipe.ch6.doctorlord startdescription|",
      "description": "|recipe.ch6.doctorlord description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "doctor": 1,
        "lord": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.doctorprior",
      "actionid": "converse",
      "label": "Conversation: Doctor & Prior",
      "craftable": "true",
      "startdescription": "|recipe.ch6.doctorprior startdescription|",
      "description": "|recipe.ch6.doctorprior description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "doctor": 1,
        "prior": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.knightsoldier",
      "actionid": "converse",
      "label": "Conversation: Knight & Soldier",
      "craftable": "true",
      "startdescription": "|recipe.ch6.knightsoldier startdescription|",
      "description": "|recipe.ch6.knightsoldier description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "knight": 1,
        "soldier": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.vicarprior",
      "actionid": "converse",
      "label": "Conversation: Vicar & Prior",
      "craftable": "true",
      "startdescription": "|recipe.ch6.vicarprior startdescription|",
      "description": "|recipe.ch6.vicarprior description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "prior": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.vicardoctor",
      "actionid": "converse",
      "label": "Conversation: Vicar & Doctor",
      "craftable": "true",
      "startdescription": "|recipe.ch6.vicardoctor startdescription|",
      "description": "|recipe.ch6.vicardoctor description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "doctor": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.vicartaverner",
      "actionid": "converse",
      "label": "Conversation: Vicar & Taverner",
      "craftable": "true",
      "startdescription": "|recipe.ch6.vicartaverner startdescription|",
      "description": "|recipe.ch6.vicartaverner description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "taverner": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.vicarscribe",
      "actionid": "converse",
      "label": "Conversation: Vicar & Scribe",
      "craftable": "true",
      "startdescription": "|recipe.ch6.vicarscribe startdescription|",
      "description": "|recipe.ch6.vicarscribe description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "scribe": 1
      },
      "tablereqs": { "chapter6": 1 }
    },
    {
      "id": "recipe.ch6.vicararbitrator",
      "actionid": "converse",
      "label": "Conversation: Vicar & Arbitrator",
      "craftable": "true",
      "startdescription": "|recipe.ch6.vicararbitrator startdescription|",
      "description": "|recipe.ch6.vicararbitrator description|",
      "warmup": 1,
      "maxexecutions": 1,
      "requirements": {
        "vicar": 1,
        "arbitrator": 1
      },
      "tablereqs": { "chapter6": 1 }
    }
  ]
}